src/Catalogs/ПравилаКонвертации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.8">
	<Catalog>
		<Properties>
			<Name>ПравилаКонвертации</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ПланОбмена</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПланыОбменов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодКонвертации</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяТипа</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбменЗапрещен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ВерсииОтправителя</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Версия</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>11</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ВерсииПолучателя</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Версия</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>11</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/Catalogs/ПравилаКонвертации/Forms/ФормаЭлемента/Ext/Form/Module.bsl
&НаСервере
Процедура ОбновитьСписокТипов()
	
	Массив = Фастекс.СоставОчереди(Объект.ПланОбмена);
	Элементы.ИмяТипа.СписокВыбора.ЗагрузитьЗначения(Массив);
	Элементы.ИмяТипа.СписокВыбора.СортироватьПоЗначению();
	
КонецПроцедуры

&НаКлиенте
Процедура ПланОбменаПриИзменении(Элемент)
	ОбновитьСписокТипов();
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ОбновитьСписокТипов();
КонецПроцедуры

&НаКлиенте
Процедура Примеры(Команда)
	Объект.КодКонвертации = Объект.КодКонвертации + "
	|//Отказ = Истина; //элемент не будет отправлен в базу-приемник
	|//
	|//Элемент = ПолучитьЭлементDOM(ТекущийОбъектDOM, <ИмяРеквизита>);
	|//Если НЕ Элемент = Неопределено Тогда
	|//	Значение = Элемент.ТекстовоеСодержимое;
	|//КонецЕсли;
	|//
	|//ДобавитьЭлементDOM(ДокументОбъектаDOM, ТекущийОбъектDOM, <ИмяРеквизита>, <?ЗначениеРеквизита>); //добавляет элемент в конец объекта
	|//УдалитьЭлементDOM(ТекущийОбъектDOM, <ИмяРеквизита>);
	|//ВставитьЭлементDOM(ДокументОбъектаDOM, ТекущийОбъектDOM, <ИмяРеквизита>, <ИмяРеквизитаПеред>, <?Значение>);
	|//ПереместитьЭлементDOM(ДокументОбъектаDOM, ТекущийОбъектDOM, <ИмяРеквизита>, <?ИмяРеквизитаПеред>);
	|
	|//ЭлементыDOM = ТекущийОбъектDOM.ПолучитьЭлементыПоИмени(""*"", Имя);
	|//Для каждого ЭлементDOM Из ЭлементыDOM Цикл
	|//	ДобавитьЭлементDOM(ДокументОбъектаDOM, ЭлементDOM, <ИмяРеквизита>, <?ЗначениеРеквизита>)
	|//	Возврат ЭлементDOM;
	|//КонецЦикла;";

КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	Оповестить();
КонецПроцедуры
